SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_frc.h
/* Bit fields for FRC LIKELYCONVSTATE */
#define _FRC_LIKELYCONVSTATE_RESETVALUE                    0x00000000UL                                        /**< Default value for FRC_LIKELYCONVSTATE       */
#define _FRC_LIKELYCONVSTATE_MASK                          0x0000003FUL                                        /**< Mask for FRC_LIKELYCONVSTATE                */
#define _FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_SHIFT         0                                                   /**< Shift value for FRC_LIKELYCONVSTATE         */
#define _FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_MASK          0x3FUL                                              /**< Bit mask for FRC_LIKELYCONVSTATE            */
#define _FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_DEFAULT       0x00000000UL                                        /**< Mode DEFAULT for FRC_LIKELYCONVSTATE        */
#define FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_DEFAULT        (_FRC_LIKELYCONVSTATE_LIKELYCONVSTATE_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_LIKELYCONVSTATE*/

/* Bit fields for FRC INTELEMENTNEXT */
#define _FRC_INTELEMENTNEXT_RESETVALUE                     0x00000000UL                                      /**< Default value for FRC_INTELEMENTNEXT        */
#define _FRC_INTELEMENTNEXT_MASK                           0x000000FFUL                                      /**< Mask for FRC_INTELEMENTNEXT                 */
#define _FRC_INTELEMENTNEXT_INTELEMENTNEXT_SHIFT           0                                                 /**< Shift value for FRC_INTELEMENTNEXT          */
#define _FRC_INTELEMENTNEXT_INTELEMENTNEXT_MASK            0xFFUL                                            /**< Bit mask for FRC_INTELEMENTNEXT             */
#define _FRC_INTELEMENTNEXT_INTELEMENTNEXT_DEFAULT         0x00000000UL                                      /**< Mode DEFAULT for FRC_INTELEMENTNEXT         */
#define FRC_INTELEMENTNEXT_INTELEMENTNEXT_DEFAULT          (_FRC_INTELEMENTNEXT_INTELEMENTNEXT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_INTELEMENTNEXT */

/* Bit fields for FRC INTWRITEPOINT */
#define _FRC_INTWRITEPOINT_RESETVALUE                      0x00000000UL                                    /**< Default value for FRC_INTWRITEPOINT         */
#define _FRC_INTWRITEPOINT_MASK                            0x0000001FUL                                    /**< Mask for FRC_INTWRITEPOINT                  */
#define _FRC_INTWRITEPOINT_INTWRITEPOINT_SHIFT             0                                               /**< Shift value for FRC_INTWRITEPOINT           */
#define _FRC_INTWRITEPOINT_INTWRITEPOINT_MASK              0x1FUL                                          /**< Bit mask for FRC_INTWRITEPOINT              */
#define _FRC_INTWRITEPOINT_INTWRITEPOINT_DEFAULT           0x00000000UL                                    /**< Mode DEFAULT for FRC_INTWRITEPOINT          */
#define FRC_INTWRITEPOINT_INTWRITEPOINT_DEFAULT            (_FRC_INTWRITEPOINT_INTWRITEPOINT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_INTWRITEPOINT  */

/* Bit fields for FRC INTREADPOINT */
#define _FRC_INTREADPOINT_RESETVALUE                       0x00000000UL                                  /**< Default value for FRC_INTREADPOINT          */
#define _FRC_INTREADPOINT_MASK                             0x0000001FUL                                  /**< Mask for FRC_INTREADPOINT                   */
#define _FRC_INTREADPOINT_INTREADPOINT_SHIFT               0                                             /**< Shift value for FRC_INTREADPOINT            */
#define _FRC_INTREADPOINT_INTREADPOINT_MASK                0x1FUL                                        /**< Bit mask for FRC_INTREADPOINT               */
#define _FRC_INTREADPOINT_INTREADPOINT_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for FRC_INTREADPOINT           */
#define FRC_INTREADPOINT_INTREADPOINT_DEFAULT              (_FRC_INTREADPOINT_INTREADPOINT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_INTREADPOINT   */

/* Bit fields for FRC AUTOCG */
#define _FRC_AUTOCG_RESETVALUE                             0x00000000UL                        /**< Default value for FRC_AUTOCG                */
#define _FRC_AUTOCG_MASK                                   0x0000FFFFUL                        /**< Mask for FRC_AUTOCG                         */
#define _FRC_AUTOCG_AUTOCGEN_SHIFT                         0                                   /**< Shift value for FRC_AUTOCGEN                */
#define _FRC_AUTOCG_AUTOCGEN_MASK                          0xFFFFUL                            /**< Bit mask for FRC_AUTOCGEN                   */
#define _FRC_AUTOCG_AUTOCGEN_DEFAULT                       0x00000000UL                        /**< Mode DEFAULT for FRC_AUTOCG                 */
#define FRC_AUTOCG_AUTOCGEN_DEFAULT                        (_FRC_AUTOCG_AUTOCGEN_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_AUTOCG         */

/* Bit fields for FRC CGCLKSTOP */
#define _FRC_CGCLKSTOP_RESETVALUE                          0x00000000UL                           /**< Default value for FRC_CGCLKSTOP             */
#define _FRC_CGCLKSTOP_MASK                                0x0000FFFFUL                           /**< Mask for FRC_CGCLKSTOP                      */
#define _FRC_CGCLKSTOP_FORCEOFF_SHIFT                      0                                      /**< Shift value for FRC_FORCEOFF                */
#define _FRC_CGCLKSTOP_FORCEOFF_MASK                       0xFFFFUL                               /**< Bit mask for FRC_FORCEOFF                   */
#define _FRC_CGCLKSTOP_FORCEOFF_DEFAULT                    0x00000000UL                           /**< Mode DEFAULT for FRC_CGCLKSTOP              */
#define FRC_CGCLKSTOP_FORCEOFF_DEFAULT                     (_FRC_CGCLKSTOP_FORCEOFF_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_CGCLKSTOP      */

/* Bit fields for FRC SEQIF */
#define _FRC_SEQIF_RESETVALUE                              0x00000000UL                                     /**< Default value for FRC_SEQIF                 */
#define _FRC_SEQIF_MASK                                    0xFFFFFFFFUL                                     /**< Mask for FRC_SEQIF                          */
#define FRC_SEQIF_TXDONE                                   (0x1UL << 0)                                     /**< TX Done Interrupt Flag                      */
#define _FRC_SEQIF_TXDONE_SHIFT                            0                                                /**< Shift value for FRC_TXDONE                  */
#define _FRC_SEQIF_TXDONE_MASK                             0x1UL                                            /**< Bit mask for FRC_TXDONE                     */
#define _FRC_SEQIF_TXDONE_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXDONE_DEFAULT                           (_FRC_SEQIF_TXDONE_DEFAULT << 0)                 /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXAFTERFRAMEDONE                         (0x1UL << 1)                                     /**< TX after frame Done Interrupt Flag          */
#define _FRC_SEQIF_TXAFTERFRAMEDONE_SHIFT                  1                                                /**< Shift value for FRC_TXAFTERFRAMEDONE        */
#define _FRC_SEQIF_TXAFTERFRAMEDONE_MASK                   0x2UL                                            /**< Bit mask for FRC_TXAFTERFRAMEDONE           */
#define _FRC_SEQIF_TXAFTERFRAMEDONE_DEFAULT                0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXAFTERFRAMEDONE_DEFAULT                 (_FRC_SEQIF_TXAFTERFRAMEDONE_DEFAULT << 1)       /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXABORTED                                (0x1UL << 2)                                     /**< Transmit Aborted Interrupt Flag             */
#define _FRC_SEQIF_TXABORTED_SHIFT                         2                                                /**< Shift value for FRC_TXABORTED               */
#define _FRC_SEQIF_TXABORTED_MASK                          0x4UL                                            /**< Bit mask for FRC_TXABORTED                  */
#define _FRC_SEQIF_TXABORTED_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXABORTED_DEFAULT                        (_FRC_SEQIF_TXABORTED_DEFAULT << 2)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXUF                                     (0x1UL << 3)                                     /**< Transmit Underflow Interrupt Flag           */
#define _FRC_SEQIF_TXUF_SHIFT                              3                                                /**< Shift value for FRC_TXUF                    */
#define _FRC_SEQIF_TXUF_MASK                               0x8UL                                            /**< Bit mask for FRC_TXUF                       */
#define _FRC_SEQIF_TXUF_DEFAULT                            0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXUF_DEFAULT                             (_FRC_SEQIF_TXUF_DEFAULT << 3)                   /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXDONE                                   (0x1UL << 4)                                     /**< RX Done Interrupt Flag                      */
#define _FRC_SEQIF_RXDONE_SHIFT                            4                                                /**< Shift value for FRC_RXDONE                  */
#define _FRC_SEQIF_RXDONE_MASK                             0x10UL                                           /**< Bit mask for FRC_RXDONE                     */
#define _FRC_SEQIF_RXDONE_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXDONE_DEFAULT                           (_FRC_SEQIF_RXDONE_DEFAULT << 4)                 /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXABORTED                                (0x1UL << 5)                                     /**< RX Aborted Interrupt Flag                   */
#define _FRC_SEQIF_RXABORTED_SHIFT                         5                                                /**< Shift value for FRC_RXABORTED               */
#define _FRC_SEQIF_RXABORTED_MASK                          0x20UL                                           /**< Bit mask for FRC_RXABORTED                  */
#define _FRC_SEQIF_RXABORTED_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXABORTED_DEFAULT                        (_FRC_SEQIF_RXABORTED_DEFAULT << 5)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_FRAMEERROR                               (0x1UL << 6)                                     /**< Frame Error Interrupt Flag                  */
#define _FRC_SEQIF_FRAMEERROR_SHIFT                        6                                                /**< Shift value for FRC_FRAMEERROR              */
#define _FRC_SEQIF_FRAMEERROR_MASK                         0x40UL                                           /**< Bit mask for FRC_FRAMEERROR                 */
#define _FRC_SEQIF_FRAMEERROR_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_FRAMEERROR_DEFAULT                       (_FRC_SEQIF_FRAMEERROR_DEFAULT << 6)             /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_BLOCKERROR                               (0x1UL << 7)                                     /**< Block Error Interrupt Flag                  */
#define _FRC_SEQIF_BLOCKERROR_SHIFT                        7                                                /**< Shift value for FRC_BLOCKERROR              */
#define _FRC_SEQIF_BLOCKERROR_MASK                         0x80UL                                           /**< Bit mask for FRC_BLOCKERROR                 */
#define _FRC_SEQIF_BLOCKERROR_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_BLOCKERROR_DEFAULT                       (_FRC_SEQIF_BLOCKERROR_DEFAULT << 7)             /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXOF                                     (0x1UL << 8)                                     /**< Receive Overflow Interrupt Flag             */
#define _FRC_SEQIF_RXOF_SHIFT                              8                                                /**< Shift value for FRC_RXOF                    */
#define _FRC_SEQIF_RXOF_MASK                               0x100UL                                          /**< Bit mask for FRC_RXOF                       */
#define _FRC_SEQIF_RXOF_DEFAULT                            0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXOF_DEFAULT                             (_FRC_SEQIF_RXOF_DEFAULT << 8)                   /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP0                                 (0x1UL << 9)                                     /**< Word Counter Compare 0 Event                */
#define _FRC_SEQIF_WCNTCMP0_SHIFT                          9                                                /**< Shift value for FRC_WCNTCMP0                */
#define _FRC_SEQIF_WCNTCMP0_MASK                           0x200UL                                          /**< Bit mask for FRC_WCNTCMP0                   */
#define _FRC_SEQIF_WCNTCMP0_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP0_DEFAULT                         (_FRC_SEQIF_WCNTCMP0_DEFAULT << 9)               /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP1                                 (0x1UL << 10)                                    /**< Word Counter Compare 1 Event                */
#define _FRC_SEQIF_WCNTCMP1_SHIFT                          10                                               /**< Shift value for FRC_WCNTCMP1                */
#define _FRC_SEQIF_WCNTCMP1_MASK                           0x400UL                                          /**< Bit mask for FRC_WCNTCMP1                   */
#define _FRC_SEQIF_WCNTCMP1_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP1_DEFAULT                         (_FRC_SEQIF_WCNTCMP1_DEFAULT << 10)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP2                                 (0x1UL << 11)                                    /**< Word Counter Compare 2 Event                */
#define _FRC_SEQIF_WCNTCMP2_SHIFT                          11                                               /**< Shift value for FRC_WCNTCMP2                */
#define _FRC_SEQIF_WCNTCMP2_MASK                           0x800UL                                          /**< Bit mask for FRC_WCNTCMP2                   */
#define _FRC_SEQIF_WCNTCMP2_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP2_DEFAULT                         (_FRC_SEQIF_WCNTCMP2_DEFAULT << 11)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_ADDRERROR                                (0x1UL << 12)                                    /**< Receive address error event                 */
#define _FRC_SEQIF_ADDRERROR_SHIFT                         12                                               /**< Shift value for FRC_ADDRERROR               */
#define _FRC_SEQIF_ADDRERROR_MASK                          0x1000UL                                         /**< Bit mask for FRC_ADDRERROR                  */
#define _FRC_SEQIF_ADDRERROR_DEFAULT                       0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_ADDRERROR_DEFAULT                        (_FRC_SEQIF_ADDRERROR_DEFAULT << 12)             /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_BUSERROR                                 (0x1UL << 13)                                    /**< A bus error event occurred                  */
#define _FRC_SEQIF_BUSERROR_SHIFT                          13                                               /**< Shift value for FRC_BUSERROR                */
#define _FRC_SEQIF_BUSERROR_MASK                           0x2000UL                                         /**< Bit mask for FRC_BUSERROR                   */
#define _FRC_SEQIF_BUSERROR_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_BUSERROR_DEFAULT                         (_FRC_SEQIF_BUSERROR_DEFAULT << 13)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXRAWEVENT                               (0x1UL << 14)                                    /**< Receiver raw data event                     */
#define _FRC_SEQIF_RXRAWEVENT_SHIFT                        14                                               /**< Shift value for FRC_RXRAWEVENT              */
#define _FRC_SEQIF_RXRAWEVENT_MASK                         0x4000UL                                         /**< Bit mask for FRC_RXRAWEVENT                 */
#define _FRC_SEQIF_RXRAWEVENT_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_RXRAWEVENT_DEFAULT                       (_FRC_SEQIF_RXRAWEVENT_DEFAULT << 14)            /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_TXRAWEVENT                               (0x1UL << 15)                                    /**< Transmit raw data event                     */
#define _FRC_SEQIF_TXRAWEVENT_SHIFT                        15                                               /**< Shift value for FRC_TXRAWEVENT              */
#define _FRC_SEQIF_TXRAWEVENT_MASK                         0x8000UL                                         /**< Bit mask for FRC_TXRAWEVENT                 */
#define _FRC_SEQIF_TXRAWEVENT_DEFAULT                      0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_TXRAWEVENT_DEFAULT                       (_FRC_SEQIF_TXRAWEVENT_DEFAULT << 15)            /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_SNIFFOF                                  (0x1UL << 16)                                    /**< Data sniffer overflow                       */
#define _FRC_SEQIF_SNIFFOF_SHIFT                           16                                               /**< Shift value for FRC_SNIFFOF                 */
#define _FRC_SEQIF_SNIFFOF_MASK                            0x10000UL                                        /**< Bit mask for FRC_SNIFFOF                    */
#define _FRC_SEQIF_SNIFFOF_DEFAULT                         0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_SNIFFOF_DEFAULT                          (_FRC_SEQIF_SNIFFOF_DEFAULT << 16)               /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP3                                 (0x1UL << 17)                                    /**< Word Counter Compare 3 Event                */
#define _FRC_SEQIF_WCNTCMP3_SHIFT                          17                                               /**< Shift value for FRC_WCNTCMP3                */
#define _FRC_SEQIF_WCNTCMP3_MASK                           0x20000UL                                        /**< Bit mask for FRC_WCNTCMP3                   */
#define _FRC_SEQIF_WCNTCMP3_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP3_DEFAULT                         (_FRC_SEQIF_WCNTCMP3_DEFAULT << 17)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_WCNTCMP4                                 (0x1UL << 18)                                    /**< Word Counter Compare 4 Event                */
#define _FRC_SEQIF_WCNTCMP4_SHIFT                          18                                               /**< Shift value for FRC_WCNTCMP4                */
#define _FRC_SEQIF_WCNTCMP4_MASK                           0x40000UL                                        /**< Bit mask for FRC_WCNTCMP4                   */
#define _FRC_SEQIF_WCNTCMP4_DEFAULT                        0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_WCNTCMP4_DEFAULT                         (_FRC_SEQIF_WCNTCMP4_DEFAULT << 18)              /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_BOISET                                   (0x1UL << 19)                                    /**< BOISET Event                                */
#define _FRC_SEQIF_BOISET_SHIFT                            19                                               /**< Shift value for FRC_BOISET                  */
#define _FRC_SEQIF_BOISET_MASK                             0x80000UL                                        /**< Bit mask for FRC_BOISET                     */
#define _FRC_SEQIF_BOISET_DEFAULT                          0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_BOISET_DEFAULT                           (_FRC_SEQIF_BOISET_DEFAULT << 19)                /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_PKTBUFSTART                              (0x1UL << 20)                                    /**< Packet Buffer Start                         */
#define _FRC_SEQIF_PKTBUFSTART_SHIFT                       20                                               /**< Shift value for FRC_PKTBUFSTART             */
#define _FRC_SEQIF_PKTBUFSTART_MASK                        0x100000UL                                       /**< Bit mask for FRC_PKTBUFSTART                */
#define _FRC_SEQIF_PKTBUFSTART_DEFAULT                     0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_PKTBUFSTART_DEFAULT                      (_FRC_SEQIF_PKTBUFSTART_DEFAULT << 20)           /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_PKTBUFTHRESHOLD                          (0x1UL << 21)                                    /**< Packet Buffer Threshold                     */
#define _FRC_SEQIF_PKTBUFTHRESHOLD_SHIFT                   21                                               /**< Shift value for FRC_PKTBUFTHRESHOLD         */
#define _FRC_SEQIF_PKTBUFTHRESHOLD_MASK                    0x200000UL                                       /**< Bit mask for FRC_PKTBUFTHRESHOLD            */
#define _FRC_SEQIF_PKTBUFTHRESHOLD_DEFAULT                 0x00000000UL                                     /**< Mode DEFAULT for FRC_SEQIF                  */
#define FRC_SEQIF_PKTBUFTHRESHOLD_DEFAULT                  (_FRC_SEQIF_PKTBUFTHRESHOLD_DEFAULT << 21)       /**< Shifted mode DEFAULT for FRC_SEQIF          */
#define FRC_SEQIF_RXRAWOF                                  (0x1UL << 22)                                    /**< RX raw FIFO overflow                        */
