SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_frc.h
/* Bit fields for FRC INTELEMENT */
#define _FRC_INTELEMENT_RESETVALUE                         0x00000000UL                              /**< Default value for FRC_INTELEMENT            */
#define _FRC_INTELEMENT_MASK                               0x000000FFUL                              /**< Mask for FRC_INTELEMENT                     */
#define _FRC_INTELEMENT_INTELEMENT_SHIFT                   0                                         /**< Shift value for FRC_INTELEMENT              */
#define _FRC_INTELEMENT_INTELEMENT_MASK                    0xFFUL                                    /**< Bit mask for FRC_INTELEMENT                 */
#define _FRC_INTELEMENT_INTELEMENT_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for FRC_INTELEMENT             */
#define FRC_INTELEMENT_INTELEMENT_DEFAULT                  (_FRC_INTELEMENT_INTELEMENT_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_INTELEMENT     */

/* Bit fields for FRC AHBCONFIG */
#define _FRC_AHBCONFIG_RESETVALUE                          0x00000001UL                                     /**< Default value for FRC_AHBCONFIG             */
#define _FRC_AHBCONFIG_MASK                                0x00000001UL                                     /**< Mask for FRC_AHBCONFIG                      */
#define FRC_AHBCONFIG_AHBHPROTBUFFERABLE                   (0x1UL << 0)                                     /**< Bufferable Privileged data for AHB          */
#define _FRC_AHBCONFIG_AHBHPROTBUFFERABLE_SHIFT            0                                                /**< Shift value for FRC_AHBHPROTBUFFERABLE      */
#define _FRC_AHBCONFIG_AHBHPROTBUFFERABLE_MASK             0x1UL                                            /**< Bit mask for FRC_AHBHPROTBUFFERABLE         */
#define _FRC_AHBCONFIG_AHBHPROTBUFFERABLE_DEFAULT          0x00000001UL                                     /**< Mode DEFAULT for FRC_AHBCONFIG              */
#define FRC_AHBCONFIG_AHBHPROTBUFFERABLE_DEFAULT           (_FRC_AHBCONFIG_AHBHPROTBUFFERABLE_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_AHBCONFIG      */

/* Bit fields for FRC SPARE */
#define _FRC_SPARE_RESETVALUE                              0x00000000UL                    /**< Default value for FRC_SPARE                 */
#define _FRC_SPARE_MASK                                    0x000000FFUL                    /**< Mask for FRC_SPARE                          */
#define _FRC_SPARE_SPARE_SHIFT                             0                               /**< Shift value for FRC_SPARE                   */
#define _FRC_SPARE_SPARE_MASK                              0xFFUL                          /**< Bit mask for FRC_SPARE                      */
#define _FRC_SPARE_SPARE_DEFAULT                           0x00000000UL                    /**< Mode DEFAULT for FRC_SPARE                  */
#define FRC_SPARE_SPARE_DEFAULT                            (_FRC_SPARE_SPARE_DEFAULT << 0) /**< Shifted mode DEFAULT for FRC_SPARE          */

/** @} End of group EFR32FG25_FRC_BitFields */
/** @} End of group EFR32FG25_FRC */
/** @} End of group Parts */

#endif /* EFR32FG25_FRC_H */
